In [1]:
import pandas as pd 
import numpy as np

In [2]:
car = pd.read_csv('quikr_car.csv')

In [3]:
car.head()

                                     name   company  year          Price  kms_driven fuel_type
0    Hyundai Santro Xing XO eRLX Euro III   Hyundai  2007         80,000  45,000 kms    Petrol
1                 Mahindra Jeep CL550 MDI  Mahindra  2006       4,25,000      40 kms    Diesel
2              Maruti Suzuki Alto 800 Vxi    Maruti  2018  Ask For Price  22,000 kms    Petrol
3  Hyundai Grand i10 Magna 1.2 Kappa VTVT   Hyundai  2014       3,25,000  28,000 kms    Petrol
4        Ford EcoSport Titanium 1.5L TDCi      Ford  2014       5,75,000  36,000 kms    Diesel

In [4]:
car.shape

(892, 6)

In [5]:
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

In [6]:
car.isnull().sum()

name           0
company        0
year           0
Price          0
kms_driven    52
fuel_type     55
dtype: int64

In [7]:
# Creating backup copy
backup=car.copy()

Quality
names are pretty inconsistent
names have company names attached to it
some names are spam like 'Maruti Ertiga showroom condition with' and 'Well mentained Tata Sumo'
company: many of the names are not of any company like 'Used', 'URJENT', and so on.
year has many non-year values
year is in object. Change to integer
Price has Ask for Price
Price has commas in its prices and is in object
kms_driven has object values with kms at last.
It has nan values and two rows have 'Petrol' in them
fuel_type has nan values

Cleaning Data

In [8]:
# year has many non-year values

car = car[car['year'].str.isnumeric()]

In [9]:
# year is in object. Change to integer

car['year'] = car['year'].astype(int)

In [10]:
print(car['year'].dtype)
car['year'].unique()

int32

array([2007, 2006, 2018, 2014, 2015, 2012, 2013, 2016, 2010, 2017, 2008,
       2011, 2019, 2009, 2005, 2000, 2003, 2004, 1995, 2002, 2001])

In [11]:
# Price has Ask for Price

car = car[car['Price'] != 'Ask For Price']

In [12]:
# year is in object. Change to integer

car['Price'] =car['Price'].str.replace(',','').astype(int)

In [13]:
# kms_driven has object values with kms at last.

car['kms_driven'] = car['kms_driven'].str.split().str.get(0).str.replace(',','')

In [14]:
# It has nan values and two rows have 'Petrol' in them

car = car[car['kms_driven'].str.isnumeric()]

In [15]:
# kms_driven is in object. Change to integer

car['kms_driven'] = car['kms_driven'].astype(int)

In [16]:
# fuel_type has nan values

# car.dropna(subset=['fuel_type'], inplace=True)

car = car[~car['fuel_type'].isna()]

In [18]:
car['fuel_type'].value_counts()

fuel_type
Petrol    428
Diesel    386
LPG         2
Name: count, dtype: int64

In [19]:
# names are pretty inconsistent

car['name'] = car['name'].str.split(' ').str.slice(0,3).str.join(' ')

In [20]:
car.isnull().sum()

name          0
company       0
year          0
Price         0
kms_driven    0
fuel_type     0
dtype: int64

In [21]:
car.duplicated().sum()

96

In [22]:
car = car.drop_duplicates()

In [23]:
car.describe()

              year         Price     kms_driven
count   720.000000  7.200000e+02     720.000000
mean   2012.325000  4.021574e+05   46787.397222
std       4.132363  4.781514e+05   34609.808464
min    1995.000000  3.000000e+04       0.000000
25%    2010.000000  1.672500e+05   27000.000000
50%    2013.000000  2.900000e+05   42000.000000
75%    2015.000000  4.899990e+05   59000.000000
max    2019.000000  8.500003e+06  400000.000000

In [24]:
# remove outliers

car = car[car['Price']<6000000]

In [25]:
car.info()

<class 'pandas.core.frame.DataFrame'>
Index: 719 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        719 non-null    object
 1   company     719 non-null    object
 2   year        719 non-null    int32
 3   Price       719 non-null    int32
 4   kms_driven  719 non-null    int32
 5   fuel_type   719 non-null    object
dtypes: int32(3), object(3)
memory usage: 30.9+ KB

In [26]:
# Resetting the index of the final cleaned data

car = car.reset_index(drop=True)

In [27]:
car.sample(5)

                     name  company  year    Price  kms_driven fuel_type
407  Maruti Suzuki Vitara   Maruti  2016   580000       25000    Diesel
303            Honda City    Honda  2000    65000       80000    Petrol
183   Maruti Suzuki Wagon   Maruti  2006    80000       71200    Petrol
580    Renault Duster 110  Renault  2013   490000       38600    Diesel
556  Maruti Suzuki Ertiga   Maruti  2012  1000000      200000    Diesel

In [28]:
car.shape

(719, 6)

In [29]:
car.to_csv('Car.csv')

In [30]:
car['fuel_type'].value_counts()

fuel_type
Petrol    388
Diesel    329
LPG         2
Name: count, dtype: int64